# імпорт бібліотеки
import colorama


# {init} ініціалізує роботу бібліотеки, щоб кольори коректно відображалися в консолі.
# {Fore} надає доступ до кольорів тексту.
# {Style} містить стилі, такі як скидання кольору до стандартного (повертає текст у «нормальний» вигляд).
from colorama import init, Fore, Style


#  Виклик — готує бібліотеку
init()

# Виведення тексту з кольором:
# Fore.GREEN встановлює зелений колір тексту для слова 'Привіт:'.
# Fore.YELLOW змінює колір тексту на жовтий для всього наступного тексту.
# end='' вказує, що в кінці рядка не потрібно додавати перенесення на новий рядок.
print(Fore.GREEN + 'Привiт: ' + Fore.YELLOW, end='')


# Отримання введення від користувача
text = input()


# Скидання кольору і виведення тексту:
# Style.RESET_ALL скидає всі стилі і кольори тексту до значень за замовчуванням, тому текст із змінної text буде виведений стандартним кольором.
print(Style.RESET_ALL)

